YCSB output txt files/test12500D/jdbc_workloadd_12500_run_240420.txt
Adding shard node URL: jdbc:mysql://localhost:3306/Benchtest
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 37910
[OVERALL], Throughput(ops/sec), 329.72830387760484
[TOTAL_GCS_PS_Scavenge], Count, 5
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 62
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.16354523872329202
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 62
[TOTAL_GC_TIME_%], Time(%), 0.16354523872329202
[READ], Operations, 11824
[READ], AverageLatency(us), 460.73849797023
[READ], MinLatency(us), 279
[READ], MaxLatency(us), 17375
[READ], 95thPercentileLatency(us), 642
[READ], 99thPercentileLatency(us), 1119
[READ], Return=OK, 11824
[READ], Return=NOT_FOUND, 61
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1893.0
[CLEANUP], MinLatency(us), 1893
[CLEANUP], MaxLatency(us), 1893
[CLEANUP], 95thPercentileLatency(us), 1893
[CLEANUP], 99thPercentileLatency(us), 1893
[INSERT], Operations, 615
[INSERT], AverageLatency(us), 51380.49430894309
[INSERT], MinLatency(us), 15264
[INSERT], MaxLatency(us), 506111
[INSERT], 95thPercentileLatency(us), 195071
[INSERT], 99thPercentileLatency(us), 326399
[INSERT], Return=OK, 615
[READ-FAILED], Operations, 61
[READ-FAILED], AverageLatency(us), 394.327868852459
[READ-FAILED], MinLatency(us), 280
[READ-FAILED], MaxLatency(us), 1137
[READ-FAILED], 95thPercentileLatency(us), 551
[READ-FAILED], 99thPercentileLatency(us), 726